src/cf/Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
					<Comment>0.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
					<Comment>0.05</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
					<Comment>0.1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
					<Comment>0.5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
					<Comment>10</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
					<Comment>50</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
					<Comment>100</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПоказателиБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиБизнеса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоказателейБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансовыхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанныхИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияДанныхИсточника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьВИтогах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ПоказателиБизнесаФормулы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Развитие бизнеса"
//
// Процедуры и функции для работы с формулами показателей
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Процедура производит расчет формулы
//
// Параметры:
//  ФормулаСтрокой			 - Строка	 - Строка, которая содержит формулу
//  СтруктураОперандов		 - Структура	 - Операнды формулы с их значениями
//  РасчетныеДанные			 - Структура	 - Результат расчетов
//  ОкруглятьВБольшуюСторону - Булево	 - Признак округления в большую сторону
//  ПравилоОкругления		 - ПеречислениеСсылка.ПорядкиОкругления	 - Порядок округления
//
Процедура РасчетДанныхПоФормуле(Знач ФормулаСтрокой, СтруктураОперандов, РасчетныеДанные, ОкруглятьВБольшуюСторону = Неопределено, ПравилоОкругления = Неопределено) Экспорт
	
	Если РасчетныеДанные = Неопределено Тогда
		РасчетныеДанные = СоздатьСтруктуруРасчетныхДанных();
	КонецЕсли;
	
	Если СтруктураОперандов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(ФормулаСтрокой, "#ЕСЛИ") > 0 Тогда
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, "#ЕСЛИ",		"?(");
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, "#ТОГДА",		",");
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, "#ИНАЧЕ",		",");
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, "#КОНЕЦЕСЛИ",	")");
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, Символы.ПС,	"");
	КонецЕсли;
	
	Для каждого Операнд Из СтруктураОперандов Цикл
		ФормулаСтрокой = СтрЗаменить(ФормулаСтрокой, Операнд.Ключ, Операнд.Значение);
	КонецЦикла;
		
	Попытка
		
		РассчитаннаяСумма = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ФормулаСтрокой);
		
		Если ЗначениеЗаполнено(РассчитаннаяСумма)
			И ЗначениеЗаполнено(ОкруглятьВБольшуюСторону)
			И ЗначениеЗаполнено(ПравилоОкругления) Тогда
			
			РасчетныеДанные.Сумма = ОкруглитьЧислоПоПравилу(РассчитаннаяСумма, ОкруглятьВБольшуюСторону, ПравилоОкругления);
			
		Иначе
			РасчетныеДанные.Сумма = РассчитаннаяСумма;
		КонецЕсли;
		
	Исключение
		
		РасчетныеДанные.ОшибкаРасчета	= Истина;
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура добавляет значение операнда в структуру операндов
//
// Параметры:
//  СоответствиеОперандов	 - Соответствие	 - Соответствие операндов и их значений
//  Операнд					 - Строка	 - Идентификатор операнда
//  Значение				 - Число	 - Значение операнда
//
Процедура ДобавитьОперандВСтруктуру(СоответствиеОперандов, Операнд, Знач Значение) Экспорт
	
	Если ТипЗнч(СоответствиеОперандов) <> Тип("Соответствие") Тогда
		
		СоответствиеОперандов = Новый Соответствие;
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Значение = Формат(Значение, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=");
	КонецЕсли;
	
	СоответствиеОперандов.Вставить(Операнд, Значение);
	
КонецПроцедуры

// Функция возвращает показатель по переданному идентификатору
//
// Параметры:
//  Идентификатор	 - Строка	 - Идентификатор показателя
//  ИсключаяСсылку	 - СправочникСсылка.ПоказателиБизнеса	 - Показатель, который необходимо игнорировать при поиске
// 
// Возвращаемое значение:
//  СправочникСсылка.ПоказателиБизнеса - Найденный показатель
//
Функция НайтиПоказательПоИдентификатору(Идентификатор, ИсключаяСсылку = Неопределено) Экспорт
	
	Результат = Новый Структура("ИдентификаторЗанят,Показатель,ТипПоказателя", Ложь, Неопределено, Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоказателиБизнеса.Ссылка КАК Показатель,
	|	ПоказателиБизнеса.ТипПоказателя КАК ТипПоказателя
	|ИЗ
	|	Справочник.ПоказателиБизнеса КАК ПоказателиБизнеса
	|ГДЕ
	|	ПоказателиБизнеса.ИдентификаторПоказателя = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ИсключаяСсылку = Выборка.Показатель Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.ИдентификаторЗанят	= Истина;
		Результат.Показатель 			= Выборка.Показатель;
		Результат.ТипПоказателя 		= Выборка.ТипПоказателя;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура получает идентификаторы операндов из строки формулы 
//
// Параметры:
//  Формула	 	 - Строка	 		- Строка формулы
//  Операнды 	 - Массив из Строка	- Массив найденных операндов
//  ВключаяДубли - Булево	 		- Если Истина, то в результат включаются повторяющиеся идентификаторы
//
Процедура ПарсингФормулыНаИдентификаторыОперандов(Формула, Операнды, ВключаяДубли = Ложь) Экспорт
	
	ТекстФормулы = СокрЛП(Формула);
	
	Если ПустаяСтрока(Формула) Тогда
		Возврат;
	КонецЕсли;
	
	СимволНачалоОперанда = СтрокаНачалаОперанда();
	СимволКонецОперанда	 = СтрокаКонцаОперанда();
	
	КоличествоОперандов = СтрЧислоВхождений(ТекстФормулы, СимволНачалоОперанда);
	
	Пока КоличествоОперандов > 0 Цикл
		
		НачалоОперанда	= Найти(ТекстФормулы, СимволНачалоОперанда);
		КонецОперанда	= Найти(ТекстФормулы, СимволКонецОперанда);
		
		Операнд 		= Сред(ТекстФормулы, НачалоОперанда, КонецОперанда - НачалоОперанда + 1);
		Идентификатор	= СтрЗаменить(СтрЗаменить(Операнд, СимволНачалоОперанда, ""), СимволКонецОперанда, "");
		Операнды.Добавить(Идентификатор);
		
		Если ВключаяДубли Тогда
			ДлинаСтроки  = СтрДлина(Операнд); 
			ТекстФормулы = СтрЗаменить(Лев(ТекстФормулы, Найти(ТекстФормулы, Операнд) + ДлинаСтроки - 1), Операнд, "")
						   + Сред(ТекстФормулы, Найти(ТекстФормулы, Операнд) + ДлинаСтроки);
			КоличествоОперандов = КоличествоОперандов - 1;
		Иначе
			КоличествоОперандов = КоличествоОперандов - СтрЧислоВхождений(ТекстФормулы, Операнд);
			ТекстФормулы 		= СтрЗаменить(ТекстФормулы, Операнд, "");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает таблицу операндов формулы
//
// Параметры:
//  ХранилищеФормул	 - Строка, Массив из Строка	 - Одна или несколько строк формул
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица операндов формулы
//
Функция ПолучитьТаблицуОперандовФормулы(ХранилищеФормул) Экспорт
	
	Операнды = Новый ТаблицаЗначений;
	Операнды.Колонки.Добавить("Операнд");
	Операнды.Колонки.Добавить("Показатель");
	Операнды.Колонки.Добавить("ТипПоказателя");
	
	Операнды.Индексы.Добавить("Операнд");
	
	Если ТипЗнч(ХранилищеФормул) = Тип("Строка") Тогда
		
		ПарсингФормулыНаОперанды(ХранилищеФормул, Операнды);
		
	ИначеЕсли ТипЗнч(ХранилищеФормул) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ХранилищеФормул Цикл
			
			ПарсингФормулыНаОперанды(ЭлементМассива, Операнды);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Операнды;
	
КонецФункции

// Процедура проверяет формулу на синтаксическую корректность
//
// Параметры:
//  Ошибки	 - Массив из Структура - Список для помещения ошибок
//  Формула	 - Строка			   - Строка формулы
//
Процедура ПроверитьФормулу(Ошибки, Формула) Экспорт
	
	Перем СоответствиеОперандов, РасчетныеДанные;
	
	ЗначениеВсехОперандов = 10; // При проверке формулы значения всех операндов принимаем равным 10
	
	ТекстФормулы = СокрЛП(Формула);
	
	Если СтрЧислоВхождений(ТекстФормулы, СтрокаНачалаОперанда() + СтрокаНачалаОперанда()) <> 0
		 ИЛИ СтрЧислоВхождений(ТекстФормулы, СтрокаКонцаОперанда()  + СтрокаКонцаОперанда()) <> 0 Тогда
		
		ТекстОшибки = НСтр("ru ='Присутствует двойной символ открытия (закрытия) операнда.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если СтрЧислоВхождений(ТекстФормулы, СтрокаНачалаОперанда()) <> СтрЧислоВхождений(ТекстФормулы, СтрокаКонцаОперанда()) Тогда
		
		ТекстОшибки = НСтр("ru ='Количество открытых операндов не равно количеству закрытых.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если СтрЧислоВхождений(ТекстФормулы, "(") <> СтрЧислоВхождений(ТекстФормулы, ")") Тогда
		
		ТекстОшибки = НСтр("ru ='Количество открытых скобок не равно количеству закрытых.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
		
	КонецЕсли;
	
	Если Ошибки <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОперандов = ПолучитьТаблицуОперандовФормулы(Формула);
	
	Для каждого Строка Из ТаблицаОперандов Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Показатель) Тогда
			
			ТекстОшибки = НСтр("ru ='Не распознан операнд %1.
										|Проверьте правильность написания формулы.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка.Операнд);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
			
		КонецЕсли;
		
		ДобавитьОперандВСтруктуру(СоответствиеОперандов, Строка.Операнд, ЗначениеВсехОперандов);
		
	КонецЦикла;
	
	РасчетДанныхПоФормуле(ТекстФормулы, СоответствиеОперандов, РасчетныеДанные);
		
	Если РасчетныеДанные.ОшибкаРасчета Тогда
		
		ТекстОшибки = НСтр("ru ='При расчете возникли ошибки. Проверьте правильность написания формулы.
			|Подробное описание:'") + Символы.ПС + РасчетныеДанные.ТекстОшибки;
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
		
	КонецЕсли;
	
	МассивПроверяемыхВыражений = ЦенообразованиеФормулыСервер.ПолучитьМассивПроверяемыхВыражений();	
	Для Каждого ЭлементМассива Из МассивПроверяемыхВыражений Цикл 
		
		Если СтрНайти(ВРег(ТекстФормулы), ЭлементМассива) > 0 Тогда
			
			ТекстОшибки = НСтр("ru ='В тексте формулы найдено недопустимое выражение %1'"); 
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ЭлементМассива);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки);

		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

// Процедура проверяет переданную формулу на бесконечный цикл
//
// Параметры:
//  Показатель		 - СправочникСсылка.ПоказателиБизнеса	 - Ссылка на показатель
//  Формула			 - Строка	 							 - Строка с формулой
//  Ошибки			 - Массив из Структура	 				 - Массив для возврата ошибок
//
Процедура ПроверитьФормулуНаБесконечныйЦикл(Показатель, Формула, Ошибки) Экспорт

	ТаблицаОперандов = ПолучитьТаблицуОперандовФормулы(Формула);

	ПосещенныеПоказатели = Новый Соответствие;
	ПосещенныеПоказатели.Вставить(Показатель, 1);
	
	Для каждого СтрокаОперанда Из ТаблицаОперандов Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаОперанда.Показатель) Тогда
			
			ТекстОшибки = НСтр("ru ='Не распознан операнд %1.
										|Проверьте правильность написания формулы %2.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаОперанда.Операнд, Показатель);
					
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
			Продолжить;
				
		КонецЕсли;
		
		Если ПосещенныеПоказатели.Получить(СтрокаОперанда.Показатель) = Неопределено Тогда
			ПроверитьФормулуНаБесконечныйЦиклРекурсивно(СтрокаОперанда.Показатель, ПосещенныеПоказатели, Ошибки);
		КонецЕсли;
			
	КонецЦикла;

КонецПроцедуры

// Функция возвращает таблицу приоритетов формул переданного дерева
//
// Параметры:
//  ДеревоОтчета						 - ДеревоЗначений    - Дерево с данными отчета
//  ИдентификаторыПоказателейДляФормул	 - Соответствие	     - Идентификаторы для поиска показателей в дереве
//  ДеревоФормы 						 - ДанныеФормыДерево - Заполняется только при вызове из формы бюджета
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с порядком вычисления формул
//
Функция СформироватьТаблицуПриоритетовФормул(ДеревоОтчета, ИдентификаторыПоказателейДляФормул, ДеревоФормы = Неопределено) Экспорт
	
	ТаблицаПриоритетовФормул = ИнициализироватьТаблицуПриоритетовФормул();
	КэшПриоритетов = Новый Соответствие;
	
	ЗаполнитьТаблицуПриоритетовФормулРекурсивно(ДеревоОтчета, ИдентификаторыПоказателейДляФормул, ТаблицаПриоритетовФормул, ДеревоФормы, КэшПриоритетов);
	ТаблицаПриоритетовФормул.Сортировать("Приоритет");
	
	Возврат ТаблицаПриоритетовФормул;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонстантныеЗначения

Функция СтрокаКонцаОперанда() Экспорт
	
	Возврат "]";
	
КонецФункции

Функция СтрокаНачалаОперанда() Экспорт
	
	Возврат "[";
	
КонецФункции

#КонецОбласти

#Область Формулы

Функция СоздатьСтруктуруРасчетныхДанных()
	
	Возврат Новый Структура("Сумма, ОшибкаРасчета, ТекстОшибки", 0, Ложь, "")
	
КонецФункции // ()

Процедура ПарсингФормулыНаОперанды(Формула, Операнды)
	
	ТекстФормулы = СокрЛП(Формула);
	
	Если ПустаяСтрока(Формула) Тогда
		Возврат;
	КонецЕсли;
	
	СимволНачалоОперанда = СтрокаНачалаОперанда();
	СимволКонецОперанда	 = СтрокаКонцаОперанда();
	
	КоличествоОперандов = СтрЧислоВхождений(ТекстФормулы, СимволНачалоОперанда);
	
	Пока КоличествоОперандов > 0 Цикл
		
		НачалоОперанда	= Найти(ТекстФормулы, СимволНачалоОперанда);
		КонецОперанда	= Найти(ТекстФормулы, СимволКонецОперанда);
		
		Операнд 		= Сред(ТекстФормулы, НачалоОперанда, КонецОперанда - НачалоОперанда + 1);
		Идентификатор	= СтрЗаменить(СтрЗаменить(Операнд, СимволНачалоОперанда, ""), СимволКонецОперанда, "");
		Результат		= НайтиПоказательПоИдентификатору(Идентификатор);
		
		Если Операнды.Найти(Операнд, "Операнд") <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НовыйОперанд = Операнды.Добавить();
		НовыйОперанд.Операнд			= Операнд;
		НовыйОперанд.Показатель			= Результат.Показатель;
		НовыйОперанд.ТипПоказателя 		= Результат.ТипПоказателя;
		
		КоличествоОперандов = КоличествоОперандов - СтрЧислоВхождений(ТекстФормулы, Операнд);
		ТекстФормулы 		= СтрЗаменить(ТекстФормулы, Операнд, "");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ПолучитьРодителейПоказателяРекурсивно(ТекущийРодитель, РодителиПоказателя)
	
	Если ТекущийРодитель.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РодителиПоказателя.Добавить(ТекущийРодитель);
	РодительРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийРодитель, "Родитель");
	ПолучитьРодителейПоказателяРекурсивно(РодительРодителя, РодителиПоказателя);
	
КонецПроцедуры 

Функция ПолучитьДетейПоказателя(Показатель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиБизнеса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПоказателиБизнеса КАК ПоказателиБизнеса
		|ГДЕ
		|	ПоказателиБизнеса.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Показатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДетиПоказателя = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДетиПоказателя.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДетиПоказателя;	
	
КонецФункции

Процедура ПроверитьФормулуНаБесконечныйЦиклРекурсивно(Показатель, ПосещенныеПоказатели, Ошибки)
	
	ПризнакПосещенностиПоказателя = ПосещенныеПоказатели.Получить(Показатель);
	
	Если ПризнакПосещенностиПоказателя = Неопределено Тогда 
		
		ПосещенныеПоказатели.Вставить(Показатель, 1);
		
	ИначеЕсли ПризнакПосещенностиПоказателя = 1 Тогда  
		
		ТекстОшибки = НСтр("ru ='Обнаружен цикл! Показатель: ""%1""'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Показатель);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
		Возврат;
		
	ИначеЕсли ПризнакПосещенностиПоказателя = 2 Тогда 
		Возврат;
	КонецЕсли;
	
	ТипПоказателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "ТипПоказателя");
		
	Если ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Группа Тогда
			
			ДетиПоказателя = ПолучитьДетейПоказателя(Показатель);
			
			Для Каждого Ребенок Из ДетиПоказателя Цикл
				
				ПроверитьФормулуНаБесконечныйЦиклРекурсивно(Ребенок, ПосещенныеПоказатели, Ошибки); 
				
			КонецЦикла;
						
	ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Формула Тогда
			
			Формула = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Показатель, "СтрокаФормулы");
			ТаблицаОперандов = ПолучитьТаблицуОперандовФормулы(Формула);
			
			Для Каждого СтрокаОперанда Из ТаблицаОперандов Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаОперанда.Показатель) Тогда
			
					ТекстОшибки = НСтр("ru ='Не распознан операнд %1.
												|Проверьте правильность написания формулы %2.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаОперанда.Операнд, Показатель);
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Формула", ТекстОшибки, "");
					Продолжить;
				
				КонецЕсли;
				
				ПроверитьФормулуНаБесконечныйЦиклРекурсивно(СтрокаОперанда.Показатель, ПосещенныеПоказатели, Ошибки);
				
			КонецЦикла;
			
	КонецЕсли;
	
	ПосещенныеПоказатели.Вставить(Показатель, 2);
	
КонецПроцедуры

Функция ОкруглитьЧислоПоПравилу(Число, ОкруглятьВБольшуюСторону, ПравилоОкругления)
	Перем Результат; // Возвращаемый результат.
	
	Если НЕ ЗначениеЗаполнено(Число) Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Если ОкруглятьВБольшуюСторону <> Истина
		И ОкруглятьВБольшуюСторону <> Ложь Тогда
		
		ОкруглятьВБольшуюСторону = Ложь;
		
	КонецЕсли;
	
	ПорядокОкругления0_01 = Перечисления.ПорядкиОкругления.Окр0_01;
	
	// Преобразуем порядок округления числа.
	// Если передали пустое значение порядка, то округлим до копеек. 
	ПорядокОкругления	= ?(ЗначениеЗаполнено(ПравилоОкругления), ПравилоОкругления, ПорядокОкругления0_01);
	Порядок 			= Число(Строка(ПорядокОкругления));
	
	// вычислим количество интервалов, входящих в число
	КоличествоИнтервал	= Число / Порядок;
	
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
	
	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		
		// Числа поделились нацело. Округлять не нужно.
		Результат	= Число;
	Иначе
		Если ОкруглятьВБольшуюСторону = Истина Тогда
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.4
			Результат = Порядок * (КоличествоЦелыхИнтервалов + 1);
		Иначе
			
			// При порядке округления "0.05" 0.371 должно округлиться до 0.35,
			// а 0.376 до 0.4
			Результат = Порядок * Окр(КоличествоИнтервал, 0, РежимОкругления.Окр15как20);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОкруглитьЦенуПоПравилам()

// Процедура рекурсивно заполняет таблицу с приоритетами расчета формул из последнего параметра
//
// Параметры:
//  СтрокиДерева						 - ДеревоЗначений	 - Дерево с данными отчета
//  ИдентификаторыПоказателейДляФормул	 - Соответствие	 	 - Идентификаторы для поиска показателей в дереве
//  ТаблицаПриоритетовФормул			 - ТаблицаЗначений	 - Таблица с порядком вычисления формул
//  ДеревоФормы 						 - ДанныеФормыДерево - Заполняется только при вызове из формы бюджета
//  КэшПриоритетов						 - Соответствие 	 - Вычисленные приоритеты формул
//
Процедура ЗаполнитьТаблицуПриоритетовФормулРекурсивно(СтрокиДерева, ИдентификаторыПоказателейДляФормул, ТаблицаПриоритетовФормул, ДеревоФормы, КэшПриоритетов)
	
	ЭтоДеревоФормы = ДеревоФормы <> Неопределено;
			
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Формула Тогда
			
			ПосещенныеПоказатели = Новый Соответствие;
			
			НоваяСтрока = ТаблицаПриоритетовФормул.Добавить();
			НоваяСтрока.Формула = СтрокаДерева;
			НоваяСтрока.Представление = СтрокаДерева.Представление;
			НоваяСтрока.Приоритет = ПолучитьПриоритетФормулыРекурсивно(СтрокаДерева,
																	   ИдентификаторыПоказателейДляФормул, 
																	   ДеревоФормы,
																	   КэшПриоритетов,
																	   ПосещенныеПоказатели);
				
		КонецЕсли;
		
		Если ЭтоДеревоФормы Тогда
			ДетиСтрокиДерева = СтрокаДерева.ПолучитьЭлементы(); 
		Иначе
			ДетиСтрокиДерева = СтрокаДерева.Строки;
		КонецЕсли;
			
		Если ДетиСтрокиДерева.Количество() > 0 Тогда
			ЗаполнитьТаблицуПриоритетовФормулРекурсивно(ДетиСтрокиДерева, 
														ИдентификаторыПоказателейДляФормул,
														ТаблицаПриоритетовФормул, 
														ДеревоФормы,
														КэшПриоритетов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПриоритетФормулыРекурсивно(СтрокаДерева, ИдентификаторыПоказателейДляФормул, ДеревоФормы, КэшПриоритетов, ПосещенныеПоказатели, Приоритет = 0)
	
	Показатель = СтрокаДерева.Показатель;
	
	ПризнакПосещенностиПоказателя = ПосещенныеПоказатели.Получить(Показатель);
	
	Если ПризнакПосещенностиПоказателя = Неопределено Тогда 
		
		ПосещенныеПоказатели.Вставить(Показатель, 1);
		
	ИначеЕсли ПризнакПосещенностиПоказателя = 1 Тогда  
		
		ТекстОшибки = СтрШаблон(НСтр("ru ='Обнаружен цикл. Показатель: ""%1""'"), Показатель);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	КэшированныйПриоритет = КэшПриоритетов.Получить(Показатель);
	Если КэшированныйПриоритет <> Неопределено Тогда
		ПосещенныеПоказатели.Вставить(Показатель, 2);
		Возврат Приоритет + КэшированныйПриоритет; 
	КонецЕсли;
	
	ЭтоДеревоФормы = ДеревоФормы <> Неопределено;
	НовыйПриоритет = Приоритет;
	
	Если Показатель.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Формула Тогда

		Операнды = Новый Массив;
		ПарсингФормулыНаИдентификаторыОперандов(Показатель.СтрокаФормулы, Операнды);
					
		Для Каждого Операнд Из Операнды Цикл
			
			СтрокаОперанда = ИдентификаторыПоказателейДляФормул.Получить(Операнд);
			
			Если СтрокаОперанда = Неопределено Тогда
				Продолжить;
			КонецЕсли;   
			
			Если ЭтоДеревоФормы Тогда
				СтрокаОперанда = ДеревоФормы.НайтиПоИдентификатору(СтрокаОперанда);
			КонецЕсли; 
				
			НовыйПриоритет = Макс(НовыйПриоритет, ПолучитьПриоритетФормулыРекурсивно(СтрокаОперанда, 
																					 ИдентификаторыПоказателейДляФормул,
																					 ДеревоФормы, 
																					 КэшПриоритетов,
																					 ПосещенныеПоказатели,
																					 Приоритет + 1));
		
		КонецЦикла;
	
	ИначеЕсли Показатель.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Группа Тогда
		
		Если ЭтоДеревоФормы Тогда
			ДетиПоказателя = СтрокаДерева.ПолучитьЭлементы(); 
		Иначе
			ДетиПоказателя = СтрокаДерева.Строки;
		КонецЕсли;
		
		Для Каждого СтрокаГруппы Из ДетиПоказателя Цикл
			НовыйПриоритет = Макс(НовыйПриоритет, ПолучитьПриоритетФормулыРекурсивно(СтрокаГруппы,
																					 ИдентификаторыПоказателейДляФормул, 
																				     ДеревоФормы,
																					 КэшПриоритетов,
																					 ПосещенныеПоказатели,
																					 Приоритет));
		КонецЦикла;
	КонецЕсли;
	
	ПосещенныеПоказатели.Вставить(Показатель, 2);
	КэшПриоритетов.Вставить(Показатель, НовыйПриоритет - Приоритет); 
	
	Возврат НовыйПриоритет;

КонецФункции

// Возвращает новую таблицу приоритетов формул
//
Функция ИнициализироватьТаблицуПриоритетовФормул()
	
	ТаблицаПриоритетовФормул = Новый ТаблицаЗначений;
	ТаблицаПриоритетовФормул.Колонки.Добавить("Формула");
	ТаблицаПриоритетовФормул.Колонки.Добавить("Приоритет");
	ТаблицаПриоритетовФормул.Колонки.Добавить("Представление");
	
	Возврат ТаблицаПриоритетовФормул;
	
КонецФункции

#КонецОбласти
